<<< some_method
arg0 is 10
arg1 is 20
arg2 is 30
>>>
<<< some_method
arg0 is 11
arg1 is 21
arg2 is 31
>>>
<<< some_method
arg0 is 22
arg1 is 32
arg2 is 12
>>>
<<< some_method
arg0 is 13
arg1 is 23
arg2 is 33
>>>
<<< some_method
arg0 is 14
arg1 is 24
arg2 is 34
>>>
<<< some_method
arg0 is 15
arg1 is 25
arg2 is 35
>>>
<<< withdef
one is 1
two is 2
three is 2
>>>
<<< withdef
one is 1
two is 10
three is 10
>>>
<<< withdef
one is 1
two is 10
three is 100
>>>
<<< withdef
one is 1
two is 2
three is 6
>>>
<<< zeroarg
<<< zeroarg
